rprouse/ESP32_CYD_Weather_Station_With_Forecast/src/main.cpp
/*
  The sketch is displaying a nice Internet Weather Station with 3 4 days forecast on an
  ESP32-Cheap Yellow Display (CYD) with 2.8-inch TFT display and 320x240 pixels resolution.

  The weather data is retrieved from OpenWeatherMap.org service and you need to get your own
  (free) API key before running the sketch.

  Please add the key, your Wi-Fi credentials, the location coordinates for the weather information and
  additional data about your Timezone in the settings file: 'All_Settings.h'.

  The code is not written by me, but from Daniel Eichhorn (https://blog.squix.ch) and was
  adapted by Bodmer as an example for his OpenWeather library (https://github.com/Bodmer/OpenWeather/).

  I changed lines of code to crrect some issues, for more information see: https://github.com/Bodmer/OpenWeather/issues/26
  1):
  Search for: String date = "Updated: " + strDate(local_time);
  Change to:  String date = "Updated: " + strDate(now());
  2)
  Search for: if ( today && id/100 == 8 && (forecast->dt[0] < forecast->sunrise || forecast->dt[0] > forecast->sunset)) id += 1000;
  Change to:  if ( today && id/100 == 8 && (now() < forecast->sunrise || now() > forecast->sunset)) id += 1000;

  The code is optimized to run on the Cheap Yellow Display ('CYD') with a screen resolution of 320 x 240 pixels in Landscape
  orientation, that is the 'ESP32-2432S028R' variant.

  The weather icons and fonts are stored in ESP32's LittleFS filesystem, so you need to upload the files in the 'data' subfolder
  first before uploading the code and starting the device.
  See 'Upload_To_LittleFS.md' for more details about this.

              >>>       IMPORTANT TO PREVENT CRASHES      <<<
  >>>>>>  Set LittleFS to at least 1.5Mbytes before uploading files  <<<<<<

  The sketch is using the TFT_eSPI library by Bodmer (https://github.com/Bodmer/TFT_eSPI), so please select the correct
  'User_Setups' file in the library folder. I prepare two files (see my GitHub Repository) that should work:
  For older device with one USB connector (chip driver ILI9341) use:
    Setup801_ESP32_CYD_ILI9341_240x320.h
  New devices with two USB connectors (chip driver ST7789) require:
    Setup805_ESP32_CYD_ST7789_240x320.h

  Original by Daniel Eichhorn, see license at end of file.

*/

/*
  This sketch uses font files created from the Noto family of fonts as bitmaps
  generated from these fonts may be freely distributed:
  https://www.google.com/get/noto/

  A processing sketch to create new fonts can be found in the Tools folder of TFT_eSPI
  https://github.com/Bodmer/TFT_eSPI/tree/master/Tools/Create_Smooth_Font/Create_font
  New fonts can be generated to include language specific characters. The Noto family
  of fonts has an extensive character set coverage.

  Json streaming parser (do not use IDE library manager version) to use is here:
  https://github.com/Bodmer/JSON_Decoder
*/

#define SERIAL_MESSAGES  // For serial output weather reports
//#define SCREEN_SERVER   // For dumping screen shots from TFT
//#define RANDOM_LOCATION // Test only, selects random weather location every refresh
//#define FORMAT_LittleFS   // Wipe LittleFS and all files!

const char* PROGRAM_VERSION = "ESP32 CYD OpenWeatherMap LittleFS V02";

#include <FS.h>
#include <LittleFS.h>

#define AA_FONT_SMALL "fonts/NSBold15"  // 15 point Noto sans serif bold
#define AA_FONT_LARGE "fonts/NSBold36"  // 36 point Noto sans serif bold
/***************************************************************************************
**                          Load the libraries and settings
***************************************************************************************/
#include <Arduino.h>

#include <SPI.h>
#include <TFT_eSPI.h>  // https://github.com/Bodmer/TFT_eSPI

// Additional functions
#include "GfxUi.h"  // Attached to this sketch
#include "MoonPhase.h"  // Attached to this sketch

// Choose library to load
#ifdef ESP8266
#include <ESP8266WiFi.h>
#elif defined(ARDUINO_ARCH_MBED) || defined(ARDUINO_ARCH_RP2040)
#if defined(ARDUINO_RASPBERRY_PI_PICO_W)
#include <WiFi.h>
#else
#include <WiFiNINA.h>
#endif
#else  // ESP32
#include <WiFi.h>
#endif


// check All_Settings.h for adapting to your needs
#include "All_Settings.h"

#include <JSON_Decoder.h>  // https://github.com/Bodmer/JSON_Decoder

#include <OpenWeather.h>  // Latest here: https://github.com/Bodmer/OpenWeather

#include "NTP_Time.h"  // Attached to this sketch, see that tab for library needs
// Time zone correction library: https://github.com/JChristensen/Timezone

/***************************************************************************************
**                          Define the globals and class instances
***************************************************************************************/

TFT_eSPI tft = TFT_eSPI();  // Invoke custom library

OW_Weather ow;  // Weather forecast library instance

OW_forecast* forecast;

boolean booted = true;

GfxUi ui = GfxUi(&tft);  // Jpeg and bmpDraw functions

long lastDownloadUpdate = millis();

/***************************************************************************************
**                          Landscape layout constants (320x240)
**  Positions only. Text datums and bitmap anchors are hard-coded inline at each
**  draw call. Y values are starting points and may be nudged when viewed on hardware.
***************************************************************************************/
#define SCREEN_W       320
#define SCREEN_H       240

// Header band
#define HEADER_DIV_Y    36
#define CLOCK_X          6   // TL datum
#define CLOCK_Y          0
#define LOCATION_X     313   // TR datum
#define LOCATION_Y       2
#define UPDATED_X      313   // TR datum
#define UPDATED_Y       21

// Left column: current conditions
#define COL_DIV_X      160   // vertical divider
#define COL_DIV_TOP     40
#define COL_DIV_BOT    188
#define CUR_ICON_X       6   // 64x64 bitmap, TL anchor
#define CUR_ICON_Y      46
#define COND_LABEL_X    78   // TL datum (right of the 64px icon)
#define COND_LABEL_Y    46
#define TEMP_X          78   // TL datum, LARGE font (drawn in updateData)
#define TEMP_Y          62
#define TEMP_UNIT_X    130   // TL datum
#define TEMP_UNIT_Y     64
#define WIND_ICON_X     24   // 36x36 compass, TL anchor
#define WIND_ICON_Y    128
#define WIND_TXT_X      68   // TL datum
#define WIND_SPEED_Y   132
#define WIND_PRESS_Y   150

// Bottom divider
#define BOTTOM_DIV_Y   190

// Forecast 2x2 grid (column centres)
#define FC_COL_L_X     200
#define FC_COL_R_X     276
#define FC_R1_DAY_Y     46
#define FC_R1_TEMP_Y    66
#define FC_R1_ICON_Y    82   // 32x32 icon, TL anchor at (centre-16, this)
#define FC_R2_DAY_Y    122
#define FC_R2_TEMP_Y   140
#define FC_R2_ICON_Y   156

// Bottom band (sun / moon / cloud / humidity)
#define SUN_X           44          // column centre
#define SUN_RISE_Y     (BB_LABEL_Y + 7)   // ML centre = Cloud TC top + fontHeight/2 (NSBold15)
#define SUN_SET_Y      (BB_VALUE_Y + 7)   // aligned with the Cloud value row
#define MOON_CX        126          // disc centre x; 34x34 bitmap anchored at (CX-17, ICON_Y)
#define MOON_ICON_Y    191
#define MOON_LABEL_Y   240
#define CLOUD_X        205   // column centre
#define HUM_X          281   // column centre
#define BB_LABEL_Y     198
#define BB_VALUE_Y     218

/***************************************************************************************
**                          Declare prototypes
***************************************************************************************/
void updateData();
void drawProgress(uint8_t percentage, String text);
void drawTime();
void drawCurrentWeather();
void drawForecast();
void drawForecastDetail(uint16_t cx, uint16_t dayY, uint16_t tempY, uint16_t iconY, uint8_t dayIndex);
const char* getMeteoconIcon(uint16_t id, bool today);
void drawAstronomy();
void drawSeparator(uint16_t y);
void drawArrow(int x, int yCentre, bool up, uint16_t colour);
void fillSegment(int x, int y, int start_angle, int sub_angle, int r, unsigned int colour);
String strDate(time_t unixTime);
String strTime(time_t unixTime);
void printWeather(void);
int leftOffset(String text, String sub);
int rightOffset(String text, String sub);
int splitIndex(String text);
int getNextDayIndex(void);

bool tft_output(int16_t x, int16_t y, uint16_t w, uint16_t h, uint16_t* bitmap) {
  // Stop further decoding as image is running off bottom of screen
  if (y >= tft.height()) return 0;

  // This function will clip the image block rendering automatically at the TFT boundaries
  tft.pushImage(x, y, w, h, bitmap);

  // Return 1 to decode next block
  return 1;
}

/***************************************************************************************
**                          Setup
***************************************************************************************/
void setup() {
  Serial.begin(115200);
  delay(500);
  Serial.println(PROGRAM_VERSION);

  tft.begin();
  tft.setRotation(1);  // Landscape 320x240 (use 3 to flip 180 deg)
  tft.fillScreen(TFT_BLACK);

